# SetApproximationDeviation Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..SetApproximationDeviation Method
AnalyticalModel Class See Also
---
Adjusts the amount by which approximation is made.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetApproximationDeviation(
	double deviation
)
```

Visual Basic
---
```text
Public Sub SetApproximationDeviation ( _
	deviation As Double _
)
```

Visual C++
---
```text
public:
void SetApproximationDeviation(
	double deviation
)
```

# ### Parameters
deviation
    Type: System..::..Double Maximum distance from line to actual curve
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This AnalyticalModel does not support approximation. |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace